ttb/app/controllers/favorites_controller.rb

  def create
    # ユーザーが他の投稿にお気に入りを付けていないか確認
    if current_user.favorites.exists?
      redirect_to posts_path, alert: '他の投稿に既にお気に入りを付けています。'
    else
      favorite = @post.favorites.new(user: current_user)
      if favorite.save
---
SELECT 1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 3], ["post_id", 26], ["created_at", "2024-09-20 10:38:00.858489"], ["updated_at", "2024-09-20 10:38:00.858489"]]

  def destroy
    favorite = @post.favorites.find_by(user: current_user)
    if favorite.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["post_id", 23], ["user_id", 3], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 78]]