ttb/app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["post_id", 11], ["user_id", 3], ["LIMIT", 1]]
---
  def create
    # 既存のFavoriteをチェック
    existing_favorite = @post.favorites.find_by(user: current_user)