ttb/app/controllers/posts_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" IN (?, ?)  [["post_id", 23], ["post_id", 27]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["post_id", 7], ["user_id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 3], ["id", 1]]
SELECT COUNT(*) AS "count_all", "users"."age" AS "users_age", "posts"."category" AS "posts_category" FROM "users" INNER JOIN "posts" ON "posts"."user_id" = "users"."id" GROUP BY "users"."age", "posts"."category"
---
  def index
    @posts = Post.all

    @posts = Post.all.includes(:favorites)

    @posts = Post.includes(:user).all

    @category_counts_by_age = User.joins(:posts)
                                    .group('users.age', 'posts.category')
                                    .count