ttb/app/controllers/posts_controller.rb

SELECT 1 AS one FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "content", "category", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "編集試し"], ["content", "あ"], ["category", "身だしなみ"], ["created_at", "2024-09-20 07:19:46.493497"], ["updated_at", "2024-09-20 07:19:46.493497"], ["user_id", 1]]
---
  def create
    # ユーザーが既にPostを持っているかどうかをチェック
    if current_user.posts.exists?
      redirect_to posts_path, alert: '1人のユーザーは1つのPostしか作成できません。'
    else
      @post = current_user.posts.new(post_params)
      if @post.save

UPDATE "posts" SET "content" = ?, "category" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "ああああああ"], ["category", "設備に関すること"], ["updated_at", "2024-09-20 07:54:35.471450"], ["id", 22]]
---
  def update
    if @post.update(post_params)