backend/app/views/posts/index.html.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["post_id", 30], ["user_id", 1], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" IN (?, ?)  [["post_id", 23], ["post_id", 27]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 30]]
---
          <!-- 一致するレコードが存在する＝すでにいいね済みの場合はdestroyアクションへ -->
          <%= button_to post_favorite_path(post, post.favorites.find_by(user: current_user)), method: :delete do %>
          <span style="color:red;">❤︎</span><%= post.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 27]]
---
          <%= button_to post_favorites_path(post), method: :post do %>
            <span>❤︎</span><%= post.favorites.count %>