ttb/app/models/favorite.rb

  def user_can_only_favorite_one_tweet
    if user.favorites.exists?
---
SELECT 1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]