ttb/app/models/post.rb

SELECT 1 AS one FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
  def favorited?(user)
    favorites.exists?(user_id: user.id)

SELECT 1 AS one FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def user_can_only_have_one_post
    if user.posts.exists?