backend/app/controllers/favorites_controller.rb

SELECT 1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 3], ["post_id", 34], ["created_at", "2024-09-21 07:23:32.990382"], ["updated_at", "2024-09-21 07:23:32.990382"]]
---
  def create
    # ユーザーが他の投稿にお気に入りを付けていないか確認
    if current_user.favorites.exists?
      render json: { error: '他の投稿に既にお気に入りを付けています。' }, status: :forbidden
    else
      favorite = @post.favorites.new(user: current_user)
      if favorite.save

SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["post_id", 12], ["user_id", 3], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 33]]
---
  def destroy
    favorite = @post.favorites.find_by(user: current_user)
    if favorite.destroy