backend/app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def create
    # ユーザーが既にPostを持っているかどうかをチェック
    user = User.find(params[:user_id])