backend/app/controllers/posts_controller.rb

  def index
    @posts = Post.all

    @posts = Post.all.includes(:favorites)

    @posts = Post.includes(:user).all

    @category_counts_by_age = User.joins(:posts)
                                    .group('users.age', 'posts.category')
                                    .count

    @chart_data = @category_counts_by_age.map do |(age, category), count|
---
SELECT "posts".* FROM "posts"
SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" IN (?, ?)  [["post_id", 23], ["post_id", 27]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["post_id", 7], ["user_id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 3], ["id", 1]]
SELECT COUNT(*) AS "count_all", "users"."age" AS "users_age", "posts"."category" AS "posts_category" FROM "users" INNER JOIN "posts" ON "posts"."user_id" = "users"."id" GROUP BY "users"."age", "posts"."category"

  def create
    # ユーザーが既にPostを持っているかどうかをチェック
    if current_user.posts.exists?
      redirect_to posts_path, alert: '1人のユーザーは1つのPostしか作成できません。'
    else
      @post = current_user.posts.new(post_params)
      if @post.save
---
SELECT 1 AS one FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "content", "category", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "髪色について"], ["content", "髪色をもっと自由に変えれるようにしてほしい。"], ["category", "校外に関すること"], ["created_at", "2024-09-21 07:22:15.229662"], ["updated_at", "2024-09-21 07:22:15.229662"], ["user_id", 5]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "content" = ?, "category" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "学食について"], ["content", "もっとメニューを増やしてほしい。"], ["category", "設備に関すること"], ["updated_at", "2024-09-21 07:23:30.507298"], ["id", 27]]